PCIS_prod/src/DataProcessors/УправлениеПроектами/УправлениеПроектами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеПроектами</name>
</mdclass:DataProcessor>

PCIS_prod/src/InformationRegisters/ХодВыполненияЗадачи/ХодВыполненияЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияЗадачи</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.Этап</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/ХодВыполненияЭтапа/ХодВыполненияЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияЭтапа</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.Этап</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/РискиПроекта/РискиПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РискиПроекта</name>
  <resources>
    <name>Реализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МерыРеагирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеРиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/ХодВыполненияПроекта/ХодВыполненияПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияПроекта</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/ВехиПроекта/ВехиПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВехиПроекта</name>
  <resources>
    <name>НаименованиеВехи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/Catalogs/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проект</name>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задача</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Этап</owners>
  <attributes>
    <name>Выполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Этап/Этап.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Этап</name>
  <owners>Catalog.Проект</owners>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЭтапа</name>
    <type>
      <types>EnumRef.ЦветЭтапа</types>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/КомандаПроекта/КомандаПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомандаПроекта</name>
  <owners>Catalog.Проект</owners>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКоманды</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/DataProcessors/УправлениеПроектами/Forms/Форма/Module.bsl
&НаСервереПроцедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	// Инициализация при открытии формы	ТекущееСостояние = "ГруппаСписокПроектов";		// Инициализируем таблицы	ТаблицаПроектов.Очистить();	ТаблицаЗадач.Очистить();	ДанныеДиаграммы.Очистить();		// УПРАВЛЯЕМ ВИДИМОСТЬЮ ГРУПП	Элементы.ГруппаСписокПроектов.Видимость = Истина;	Элементы.Главная.Видимость = Ложь;	Элементы.Задачи.Видимость = Ложь;	Элементы.ГруппаКарточкаЗадачи.Видимость = Ложь;	Элементы.Риски.Видимость = Ложь;	Элементы.Команда.Видимость = Ложь;	Элементы.ГруппаОтчеты.Видимость = Ложь;		// Загружаем список проектов	ОбновитьСписокПроектовНаСервере();		Сообщить("Форма инициализирована. Проектов загружено: " + ТаблицаПроектов.Количество());КонецПроцедуры// ==================== ПЕРЕКЛЮЧЕНИЕ СТРАНИЦ ====================&НаКлиентеПроцедура ПереключитьСтраницу(ИмяГруппы)	ПереключитьСтраницуНаСервере(ИмяГруппы);		// Если открыли Главную группу - заполняем Гант с небольшой задержкой	Если ИмяГруппы = "Главная" Тогда		ПодключитьОбработчикОжидания("ЗаполнитьГантНаКлиентеОжидание", 1, Истина);	КонецЕсли;КонецПроцедуры&НаКлиентеПроцедура ЗаполнитьГантНаКлиентеОжидание()	ОтключитьОбработчикОжидания("ЗаполнитьГантНаКлиентеОжидание");	ЗаполнитьГантНаКлиенте();КонецПроцедуры&НаСервереПроцедура ПереключитьСтраницуНаСервере(ИмяГруппы)	// Скрываем все группы	Элементы.ГруппаСписокПроектов.Видимость = Ложь;	Элементы.Главная.Видимость = Ложь;	Элементы.Задачи.Видимость = Ложь;	Элементы.ГруппаКарточкаЗадачи.Видимость = Ложь;	Элементы.Риски.Видимость = Ложь;	Элементы.Команда.Видимость = Ложь;	Элементы.ГруппаОтчеты.Видимость = Ложь;		// Показываем целевую группу	Попытка		Элементы[ИмяГруппы].Видимость = Истина;		ТекущееСостояние = ИмяГруппы;	Исключение		Сообщить("Группа не найдена: " + ИмяГруппы);		Возврат;	КонецПопытки;		// Загружаем данные для соответствующей группы	Если ИмяГруппы = "ГруппаСписокПроектов" Тогда		ОбновитьСписокПроектовНаСервере();			ИначеЕсли ИмяГруппы = "Главная" Тогда		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда			Сообщить("⚠ Пожалуйста, сначала выберите проект!");			Возврат;		КонецЕсли;		ОбновитьТаблицуЗадачНаСервере();		ПостроитьДиаграммуГанта();		Сообщить("✓ Данные загружены. На странице 'Задачи' вы можете увидеть все задачи проекта с датами и прогрессом.");			ИначеЕсли ИмяГруппы = "Задачи" Тогда		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда			Сообщить("⚠ Пожалуйста, сначала выберите проект!");			Возврат;		КонецЕсли;		ОбновитьТаблицуЗадачНаСервере();	КонецЕсли;КонецПроцедуры// ==================== КНОПКИ НАВИГАЦИИ (на клиенте) ====================&НаКлиентеПроцедура КомандаМенюГлавная(Команда)	ПереключитьСтраницу("Главная");КонецПроцедуры&НаКлиентеПроцедура КомандаМенюНазад(Команда)	ПереключитьСтраницу("ГруппаСписокПроектов");КонецПроцедуры&НаКлиентеПроцедура КомандаМенюЗадачи(Команда)	ПереключитьСтраницу("Задачи");КонецПроцедуры&НаКлиентеПроцедура КомандаМенюПроекты(Команда)	ПереключитьСтраницу("ГруппаСписокПроектов");КонецПроцедуры&НаКлиентеПроцедура КомандаМенюКоманда(Команда)	ПереключитьСтраницу("Команда");КонецПроцедуры&НаКлиентеПроцедура КомандаМенюРиски(Команда)	ПереключитьСтраницу("Риски");КонецПроцедуры&НаКлиентеПроцедура КомандаМенюОтчеты(Команда)	ПереключитьСтраницу("ГруппаОтчеты");КонецПроцедуры// ==================== ЗАГРУЗКА ДАННЫХ ====================&НаСервереПроцедура ОбновитьСписокПроектовНаСервере()	Попытка		ТаблицаПроектов.Очистить();				Запрос = Новый Запрос;		Запрос.Текст = 			"ВЫБРАТЬ			|	Проект.Ссылка КАК Ссылка,			|	Проект.Наименование КАК Наименование,			|	Проект.ПланДатаНачала КАК ДатаНачала,			|	Проект.ПланДатаОкончания КАК ДатаОкончания			|ИЗ			|	Справочник.Проект КАК Проект			|ГДЕ			|	НЕ Проект.ПометкаУдаления			|УПОРЯДОЧИТЬ ПО			|	Проект.Наименование";				РезультатЗапроса = Запрос.Выполнить();				Если НЕ РезультатЗапроса.Пустой() Тогда			ТаблицаПроектов.Загрузить(РезультатЗапроса.Выгрузить());			Сообщить("✓ Проекты загружены: " + ТаблицаПроектов.Количество());		Иначе			Сообщить("⚠ Проектов не найдено в справочнике 'Проект'");		КонецЕсли;	Исключение		Сообщить("✗ Ошибка загрузки проектов: " + ОписаниеОшибки());	КонецПопытки;КонецПроцедуры&НаСервереПроцедура ОбновитьТаблицуЗадачНаСервере()	Попытка		ТаблицаЗадач.Очистить();				Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда			Сообщить("⚠ Проект не выбран");			Возврат;		КонецЕсли;				Запрос = Новый Запрос;		Запрос.Текст = 			"ВЫБРАТЬ			|	ЗадачаДан.Ссылка КАК Ссылка,			|	ЗадачаДан.Наименование КАК Наименование,			|	ЗадачаДан.Владелец КАК ЭтапСсылка,			|	ЭтапДан.Наименование КАК НаименованиеЭтапа,			|	ЗадачаДан.ПланДатаНачала КАК ПланДатаНачала,			|	ЗадачаДан.ПланДатаОкончания КАК ПланДатаОкончания,			|	ЕСТЬNULL(ХодЗадачи.ПроцентВыполнения, 0) КАК ПроцентВыполнения,			|	ЕСТЬNULL(ХодЗадачи.СтатусВыполнения, ""Запланирована"") КАК Статус			|ИЗ			|	Справочник.Задача КАК ЗадачаДан			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Этап КАК ЭтапДан			|			ПО ЗадачаДан.Владелец = ЭтапДан.Ссылка			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХодВыполненияЗадачи КАК ХодЗадачи			|			ПО ЗадачаДан.Ссылка = ХодЗадачи.Задача			|ГДЕ			|	ЭтапДан.Владелец = &ПроектПарам			|	И НЕ ЗадачаДан.ПометкаУдаления";				Запрос.УстановитьПараметр("ПроектПарам", ТекущийПроект);		РезультатЗапроса = Запрос.Выполнить();				Если НЕ РезультатЗапроса.Пустой() Тогда			ТаблицаЗадач.Загрузить(РезультатЗапроса.Выгрузить());			Сообщить("✓ Задачи загружены: " + ТаблицаЗадач.Количество());		Иначе			Сообщить("⚠ Задач не найдено для проекта");		КонецЕсли;	Исключение		Сообщить("✗ Ошибка загрузки задач: " + ОписаниеОшибки());	КонецПопытки;КонецПроцедуры// ==================== ДИАГРАММА ГАНТА ====================&НаСервереПроцедура ПостроитьДиаграммуГанта()	Попытка		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда			Сообщить("⚠ Проект не выбран");			Возврат;		КонецЕсли;				// Очищаем данные диаграммы		ДанныеДиаграммы.Очистить();				Запрос = Новый Запрос;		Запрос.Текст = 			"ВЫБРАТЬ			|	ЗадачаДан.Ссылка КАК Ссылка,			|	ЗадачаДан.Наименование КАК Наименование,			|	ЗадачаДан.ПланДатаНачала КАК ДатаНачала,			|	ЗадачаДан.ПланДатаОкончания КАК ДатаОкончания,			|	ЭтапДан.Наименование КАК НаименованиеЭтапа,			|	ЕСТЬNULL(ХодЗадачи.ПроцентВыполнения, 0) КАК ПроцентВыполнения			|ИЗ			|	Справочник.Задача КАК ЗадачаДан			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Этап КАК ЭтапДан			|			ПО ЗадачаДан.Владелец = ЭтапДан.Ссылка			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХодВыполненияЗадачи КАК ХодЗадачи			|			ПО ЗадачаДан.Ссылка = ХодЗадачи.Задача			|ГДЕ			|	ЭтапДан.Владелец = &ПроектПарам			|	И НЕ ЗадачаДан.ПометкаУдаления			|УПОРЯДОЧИТЬ ПО			|	ЗадачаДан.ПланДатаНачала";				Запрос.УстановитьПараметр("ПроектПарам", ТекущийПроект);		Результат = Запрос.Выполнить().Выбрать();				Пока Результат.Следующий() Цикл			НоваяСтрока = ДанныеДиаграммы.Добавить();			НоваяСтрока.Наименование = Результат.Наименование;			НоваяСтрока.ДатаНачала = Результат.ДатаНачала;			НоваяСтрока.ДатаОкончания = Результат.ДатаОкончания;			НоваяСтрока.НаименованиеЭтапа = Результат.НаименованиеЭтапа;						// СОХРАНЯЕМ ПРОЦЕНТ КАК ЧИСЛО			Процент = Результат.ПроцентВыполнения;			НоваяСтрока.ПроцентВыполнения = Процент;						// ВИЗУАЛИЗАЦИЯ: преобразуем процент в звёздочки			КоличествоЗвезд = Окр(Процент / 20, 0); // 5 звёзд за 100%						Визуализация = "";			Для i = 1 По КоличествоЗвезд Цикл				Визуализация = Визуализация + "★";			КонецЦикла;			Для i = КоличествоЗвезд По 4 Цикл				Визуализация = Визуализация + "☆";			КонецЦикла;						НоваяСтрока.ПрогрессВизуализация = Визуализация;		КонецЦикла;				Сообщить("✓ Таблица задач с процентом выполнения подготовлена. Строк: " + ДанныеДиаграммы.Количество());	Исключение		Сообщить("✗ Ошибка построения таблицы: " + ОписаниеОшибки());	КонецПопытки;КонецПроцедуры&НаКлиентеПроцедура ГлавнаяПриАктивизации(Элемент)	// Заполняем Гант при активации группы Главная	ЗаполнитьГантНаКлиенте();КонецПроцедуры// ==================== ЗАПОЛНЕНИЕ ГАНТА ====================&НаКлиентеПроцедура ЗаполнитьГантНаКлиенте()	Попытка		Сообщить("✓ Данные Ганта подготовлены. Таблица задач содержит: " + ДанныеДиаграммы.Количество() + " элементов");	Исключение		Сообщить("✗ Ошибка: " + ОписаниеОшибки());	КонецПопытки;КонецПроцедуры// ==================== ВЫБОР ПРОЕКТА ====================&НаКлиентеПроцедура ТаблицаПроектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	СтандартнаяОбработка = Ложь;	Данные = Элемент.ТекущиеДанные;		Если Данные <> Неопределено И Данные.Ссылка <> Неопределено Тогда		ТекущийПроект = Данные.Ссылка;		ОбновитьШапкуПроекта();		Сообщить("✓ Выбран проект: " + Данные.Наименование);		ПереключитьСтраницу("Главная");	КонецЕсли;КонецПроцедуры&НаСервереПроцедура ОбновитьШапкуПроекта()	Если ЗначениеЗаполнено(ТекущийПроект) Тогда		Попытка			ШапкаПроекта = ТекущийПроект.Наименование;		Исключение			ШапкаПроекта = "Проект";		КонецПопытки;	Иначе		ШапкаПроекта = "Проект не выбран";	КонецЕсли;КонецПроцедуры// ==================== ОБРАБОТКА ЗАДАЧ ====================&НаКлиентеПроцедура ТаблицаЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	СтандартнаяОбработка = Ложь;	Данные = Элемент.ТекущиеДанные;		Если Данные <> Неопределено И Данные.Ссылка <> Неопределено Тогда		ТекущаяЗадача = Данные.Ссылка;		ПереключитьСтраницу("ГруппаКарточкаЗадачи");		ОбновитьКарточкуЗадачи();	КонецЕсли;КонецПроцедуры&НаСервереПроцедура ОбновитьКарточкуЗадачи()	Если ЗначениеЗаполнено(ТекущаяЗадача) Тогда		Попытка			ЗадачаНаименование = ТекущаяЗадача.Наименование;			ЗадачаПланНачало = ТекущаяЗадача.ПланДатаНачала;			ЗадачаПланОкончание = ТекущаяЗадача.ПланДатаОкончания;			ЗадачаПроцент = 0;			ЗадачаСтатус = "Запланирована";						Сообщить("✓ Карточка задачи загружена");		Исключение			Сообщить("✗ Ошибка загрузки задачи: " + ОписаниеОшибки());		КонецПопытки;	КонецЕсли;КонецПроцедуры// ==================== СОХРАНЕНИЕ ЗАДАЧИ ====================&НаКлиентеПроцедура КнопкаСохранитьЗадачу(Команда)	СохранитьЗадачуНаСервере();КонецПроцедуры&НаСервере
Процедура СохранитьЗадачуНаСервере()
	Если ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		Попытка
			ОбъектЗадачи = ТекущаяЗадача.ПолучитьОбъект();
			ОбъектЗадачи.Наименование = ЗадачаНаименование;
			ОбъектЗадачи.ПланДатаНачала = ЗадачаПланНачало;
			ОбъектЗадачи.ПланДатаОкончания = ЗадачаПланОкончание;
			ОбъектЗадачи.Написать();
			
			ПроектныеРасчеты.ОбновитьПоЗадаче(ТекущаяЗадача);
			
			Сообщить("✓ Задача сохранена");
			ОбновитьТаблицуЗадачНаСервере();
		Исключение
			Сообщить("✗ Ошибка сохранения задачи: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

// ==================== ГРУППА "ЭТАПЫ" ====================

&НаСервере
Процедура ОбновитьТаблицуЭтаповНаСервере()
	Попытка
		ТаблицаЭтапов.Очистить();
		
		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда
			Сообщить("⚠ Проект не выбран");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭтапДан.Ссылка КАК Ссылка,
			|	ЭтапДан.Наименование КАК Наименование,
			|	ЭтапДан.ЦветЭтапа КАК ЦветЭтапа,
			|	ЭтапДан.ПланДатаНачала КАК ПланДатаНачала,
			|	ЭтапДан.ПланДатаОкончания КАК ПланДатаОкончания,
			|	ЕСТЬNULL(ХодЭтапа.ПроцентВыполнения, 0) КАК ПроцентВыполнения,
			|	ЕСТЬNULL(ХодЭтапа.СтатусВыполнения, ""Запланирован"") КАК Статус,
			|	ХодЭтапа.ФактДатаНачала КАК ФактДатаНачала,
			|	ХодЭтапа.ФактДатаОкончания КАК ФактДатаОкончания
			|ИЗ
			|	Справочник.Этап КАК ЭтапДан
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХодВыполненияЭтапа КАК ХодЭтапа
			|			ПО ЭтапДан.Ссылка = ХодЭтапа.Этап
			|ГДЕ
			|	ЭтапДан.Владелец = &ПроектПарам
			|	И НЕ ЭтапДан.ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО
			|	ЭтапДан.ПланДатаНачала";
		
		Запрос.УстановитьПараметр("ПроектПарам", ТекущийПроект);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаЭтапов.Загрузить(РезультатЗапроса.Выгрузить());
			Сообщить("✓ Этапы загружены: " + ТаблицаЭтапов.Количество());
		Иначе
			Сообщить("⚠ Этапов не найдено для проекта");
		КонецЕсли;
	Исключение
		Сообщить("✗ Ошибка загрузки этапов: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭтаповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элемент.ТекущиеДанные;
	
	Если Данные <> Неопределено И Данные.Ссылка <> Неопределено Тогда
		ТекущийЭтап = Данные.Ссылка;
		ПереключитьСтраницу("ГруппаКарточкаЭтапа");
		ОбновитьКарточкуЭтапа();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКарточкуЭтапа()
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда
		Попытка
			ЭтапОбъект = ТекущийЭтап.ПолучитьОбъект();
			ЭтапНаименование = ЭтапОбъект.Наименование;
			ЭтапЦвет = ЭтапОбъект.ЦветЭтапа;
			ЭтапПланНачало = ЭтапОбъект.ПланДатаНачала;
			ЭтапПланОкончание = ЭтапОбъект.ПланДатаОкончания;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Ход.ПроцентВыполнения,
				|	Ход.СтатусВыполнения,
				|	Ход.ФактДатаНачала,
				|	Ход.ФактДатаОкончания
				|ИЗ
				|	РегистрСведений.ХодВыполненияЭтапа КАК Ход
				|ГДЕ
				|	Ход.Этап = &Этап";
			Запрос.УстановитьПараметр("Этап", ТекущийЭтап);
			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЭтапПроцент = Выборка.ПроцентВыполнения;
				ЭтапСтатус = Выборка.СтатусВыполнения;
				ЭтапФактНачало = Выборка.ФактДатаНачала;
				ЭтапФактОкончание = Выборка.ФактДатаОкончания;
			Иначе
				ЭтапПроцент = 0;
				ЭтапСтатус = "Запланирован";
				ЭтапФактНачало = Неопределено;
				ЭтапФактОкончание = Неопределено;
			КонецЕсли;
			
			Сообщить("✓ Карточка этапа загружена");
		Исключение
			Сообщить("✗ Ошибка загрузки этапа: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьЭтап(Команда)
	СохранитьЭтапНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьИВыйтиЭтап(Команда)
	СохранитьЭтапНаСервере();
	ПереключитьСтраницу("Этапы");
КонецПроцедуры

&НаСервере
Процедура СохранитьЭтапНаСервере()
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда
		Попытка
			ОбъектЭтапа = ТекущийЭтап.ПолучитьОбъект();
			ОбъектЭтапа.Наименование = ЭтапНаименование;
			ОбъектЭтапа.ЦветЭтапа = ЭтапЦвет;
			ОбъектЭтапа.ПланДатаНачала = ЭтапПланНачало;
			ОбъектЭтапа.ПланДатаОкончания = ЭтапПланОкончание;
			ОбъектЭтапа.Написать();
			
			ПроектныеРасчеты.ПересчитатьЭтап(ТекущийЭтап);
			
			Сообщить("✓ Этап сохранен");
			ОбновитьТаблицуЭтаповНаСервере();
		Исключение
			Сообщить("✗ Ошибка сохранения этапа: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

// ==================== ГРУППА "КОМАНДА ПРОЕКТА" ====================

&НаСервере
Процедура ОбновитьСписокУчастниковНаСервере()
	Попытка
		СписокУчастников.Очистить();
		
		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда
			Сообщить("⚠ Проект не выбран");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Команда.Ссылка КАК Ссылка,
			|	Команда.Должность КАК Должность,
			|	Команда.ЧленКоманды КАК ЧленКоманды,
			|	Команда.ЧленКоманды.ФамилияИмяОтчество КАК ФИО
			|ИЗ
			|	Справочник.КомандаПроекта КАК Команда
			|ГДЕ
			|	Команда.Проект = &Проект
			|	И НЕ Команда.ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО
			|	Команда.Должность";
		
		Запрос.УстановитьПараметр("Проект", ТекущийПроект);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			СписокУчастников.Загрузить(РезультатЗапроса.Выгрузить());
			Сообщить("✓ Участники команды загружены: " + СписокУчастников.Количество());
		Иначе
			// Добавляем пустую строку для нового участника
			НоваяСтрока = СписокУчастников.Добавить();
			Сообщить("⚠ Команда проекта пуста");
		КонецЕсли;
	Исключение
		Сообщить("✗ Ошибка загрузки команды: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьУчастника(Команда)
	НоваяСтрока = СписокУчастников.Добавить();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьКоманду(Команда)
	СохранитьКомандуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьКомандуНаСервере()
	Попытка
		Для Каждого Стр Из СписокУчастников Цикл
			Если Стр.Ссылка = Неопределено И (ЗначениеЗаполнено(Стр.Должность) ИЛИ ЗначениеЗаполнено(Стр.ЧленКоманды)) Тогда
				НовыйУчастник = Справочники.КомандаПроекта.СоздатьЭлемент();
				НовыйУчастник.Проект = ТекущийПроект;
				НовыйУчастник.Должность = Стр.Должность;
				НовыйУчастник.ЧленКоманды = Стр.ЧленКоманды;
				НовыйУчастник.Написать();
				Стр.Ссылка = НовыйУчастник.Ссылка;
			ИначеЕсли Стр.Ссылка <> Неопределено Тогда
				УчастникОбъект = Стр.Ссылка.ПолучитьОбъект();
				УчастникОбъект.Должность = Стр.Должность;
				УчастникОбъект.ЧленКоманды = Стр.ЧленКоманды;
				УчастникОбъект.Написать();
			КонецЕсли;
		КонецЦикла;
		
		Сообщить("✓ Команда проекта сохранена");
		ОбновитьСписокУчастниковНаСервере();
	Исключение
		Сообщить("✗ Ошибка сохранения команды: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// ==================== ГРУППА "РИСКИ ПРОЕКТА" ====================

&НаСервере
Процедура ОбновитьСписокРисковНаСервере()
	Попытка
		СписокРисков.Очистить();
		
		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда
			Сообщить("⚠ Проект не выбран");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Риск.НаименованиеРиска КАК НаименованиеРиска,
			|	Риск.Реализация КАК Реализация,
			|	Риск.ДатаРеализации КАК ДатаРеализации,
			|	Риск.МерыРеагирования КАК МерыРеагирования
			|ИЗ
			|	РегистрСведений.РискиПроекта КАК Риск
			|ГДЕ
			|	Риск.Проект = &Проект
			|УПОРЯДОЧИТЬ ПО
			|	Риск.Реализация УБЫВ, Риск.НаименованиеРиска";
		
		Запрос.УстановитьПараметр("Проект", ТекущийПроект);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			СписокРисков.Загрузить(РезультатЗапроса.Выгрузить());
			Сообщить("✓ Риски загружены: " + СписокРисков.Количество());
		Иначе
			НоваяСтрока = СписокРисков.Добавить();
			Сообщить("⚠ Рисков не найдено");
		КонецЕсли;
	Исключение
		Сообщить("✗ Ошибка загрузки рисков: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьРиск(Команда)
	НоваяСтрока = СписокРисков.Добавить();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьРиски(Команда)
	СохранитьРискиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьРискиНаСервере()
	Попытка
		Для Каждого Стр Из СписокРисков Цикл
			Если ЗначениеЗаполнено(Стр.НаименованиеРиска) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Риск.НаименованиеРиска
					|ИЗ
					|	РегистрСведений.РискиПроекта КАК Риск
					|ГДЕ
					|	Риск.Проект = &Проект
					|	И Риск.НаименованиеРиска = &Наименование";
				Запрос.УстановитьПараметр("Проект", ТекущийПроект);
				Запрос.УстановитьПараметр("Наименование", Стр.НаименованиеРиска);
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда
					// Новый риск
					Запись = РегистрыСведений.РискиПроекта.СоздатьМенеджерЗаписи();
					Запись.Проект = ТекущийПроект;
					Запись.НаименованиеРиска = Стр.НаименованиеРиска;
					Запись.Реализация = Стр.Реализация;
					Запись.ДатаРеализации = ?(Стр.Реализация, ТекущаяДатаСеанса(), Неопределено);
					Запись.МерыРеагирования = Стр.МерыРеагирования;
					Запись.Записать();
				Иначе
					// Обновляем существующий
					Запись = РегистрыСведений.РискиПроекта.СоздатьМенеджерЗаписи();
					Запись.Проект = ТекущийПроект;
					Запись.НаименованиеРиска = Стр.НаименованиеРиска;
					Запись.Реализация = Стр.Реализация;
					Запись.ДатаРеализации = ?(Стр.Реализация, ТекущаяДатаСеанса(), Неопределено);
					Запись.МерыРеагирования = Стр.МерыРеагирования;
					Запись.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Сообщить("✓ Риски сохранены");
		ОбновитьСписокРисковНаСервере();
	Исключение
		Сообщить("✗ Ошибка сохранения рисков: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// ==================== ГРУППА "КАРТОЧКА ПРОЕКТА" ====================

&НаСервере
Процедура ОбновитьКарточкуПроектаНаСервере()
	Попытка
		Если НЕ ЗначениеЗаполнено(ТекущийПроект) Тогда
			Сообщить("⚠ Проект не выбран");
			Возврат;
		КонецЕсли;
		
		ПроектОбъект = ТекущийПроект.ПолучитьОбъект();
		ПроектНаименование = ПроектОбъект.Наименование;
		ПроектПланНачало = ПроектОбъект.ПланДатаНачала;
		ПроектПланОкончание = ПроектОбъект.ПланДатаОкончания;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ход.ПроцентВыполнения,
			|	Ход.СтатусВыполнения,
			|	Ход.ФактДатаНачала,
			|	Ход.ФактДатаОкончания
			|ИЗ
			|	РегистрСведений.ХодВыполненияПроекта КАК Ход
			|ГДЕ
			|	Ход.Проект = &Проект";
		Запрос.УстановитьПараметр("Проект", ТекущийПроект);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПроектПроцент = Выборка.ПроцентВыполнения;
			ПроектСтатус = Выборка.СтатусВыполнения;
			ПроектФактНачало = Выборка.ФактДатаНачала;
			ПроектФактОкончание = Выборка.ФактДатаОкончания;
		Иначе
			ПроектПроцент = 0;
			ПроектСтатус = "Запланирован";
			ПроектФактНачало = Неопределено;
			ПроектФактОкончание = Неопределено;
		КонецЕсли;
		
		// Загружаем этапы проекта
		СписокЭтаповПроекта.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Этап.Ссылка КАК Ссылка,
			|	Этап.Наименование КАК Наименование,
			|	Этап.ПланДатаНачала КАК ПланДатаНачала,
			|	Этап.ПланДатаОкончания КАК ПланДатаОкончания,
			|	ЕСТЬNULL(Ход.ПроцентВыполнения, 0) КАК ПроцентВыполнения,
			|	ЕСТЬNULL(Ход.СтатусВыполнения, ""Запланирован"") КАК Статус
			|ИЗ
			|	Справочник.Этап КАК Этап
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХодВыполненияЭтапа КАК Ход
			|			ПО Этап.Ссылка = Ход.Этап
			|ГДЕ
			|	Этап.Владелец = &Проект
			|	И НЕ Этап.ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО
			|	Этап.ПланДатаНачала";
		Запрос.УстановитьПараметр("Проект", ТекущийПроект);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			СписокЭтаповПроекта.Загрузить(Результат.Выгрузить());
		КонецЕсли;
		
		// Загружаем вехи проекта
		СписокВехПроекта.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Веха.НаименованиеВехи КАК НаименованиеВехи,
			|	Веха.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.ВехиПроекта КАК Веха
			|ГДЕ
			|	Веха.Проект = &Проект
			|УПОРЯДОЧИТЬ ПО
			|	Веха.НаименованиеВехи";
		Запрос.УстановитьПараметр("Проект", ТекущийПроект);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			СписокВехПроекта.Загрузить(Результат.Выгрузить());
		КонецЕсли;
		
		Сообщить("✓ Карточка проекта загружена");
	Исключение
		Сообщить("✗ Ошибка загрузки карточки проекта: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьЭтап(Команда)
	НоваяСтрока = СписокЭтаповПроекта.Добавить();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьВеху(Команда)
	НоваяСтрока = СписокВехПроекта.Добавить();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьПроект(Команда)
	СохранитьПроектНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьПроектНаСервере()
	Попытка
		// Сохраняем проект
		ПроектОбъект = ТекущийПроект.ПолучитьОбъект();
		ПроектОбъект.Наименование = ПроектНаименование;
		ПроектОбъект.ПланДатаНачала = ПроектПланНачало;
		ПроектОбъект.ПланДатаОкончания = ПроектПланОкончание;
		ПроектОбъект.Написать();
		
		// Сохраняем этапы
		Для Каждого Стр Из СписокЭтаповПроекта Цикл
			Если Стр.Ссылка = Неопределено И ЗначениеЗаполнено(Стр.Наименование) Тогда
				НовыйЭтап = Справочники.Этап.СоздатьЭлемент();
				НовыйЭтап.Владелец = ТекущийПроект;
				НовыйЭтап.Наименование = Стр.Наименование;
				НовыйЭтап.ПланДатаНачала = Стр.ПланДатаНачала;
				НовыйЭтап.ПланДатаОкончания = Стр.ПланДатаОкончания;
				НовыйЭтап.Написать();
				Стр.Ссылка = НовыйЭтап.Ссылка;
			ИначеЕсли Стр.Ссылка <> Неопределено Тогда
				ЭтапОбъект = Стр.Ссылка.ПолучитьОбъект();
				ЭтапОбъект.Наименование = Стр.Наименование;
				ЭтапОбъект.ПланДатаНачала = Стр.ПланДатаНачала;
				ЭтапОбъект.ПланДатаОкончания = Стр.ПланДатаОкончания;
				ЭтапОбъект.Написать();
			КонецЕсли;
		КонецЦикла;
		
		// Сохраняем вехи
		Для Каждого Стр Из СписокВехПроекта Цикл
			Если ЗначениеЗаполнено(Стр.НаименованиеВехи) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Веха.НаименованиеВехи
					|ИЗ
					|	РегистрСведений.ВехиПроекта КАК Веха
					|ГДЕ
					|	Веха.Проект = &Проект
					|	И Веха.НаименованиеВехи = &Наименование";
				Запрос.УстановитьПараметр("Проект", ТекущийПроект);
				Запрос.УстановитьПараметр("Наименование", Стр.НаименованиеВехи);
				Результат = Запрос.Выполнить();
				
				Запись = РегистрыСведений.ВехиПроекта.СоздатьМенеджерЗаписи();
				Запись.Проект = ТекущийПроект;
				Запись.НаименованиеВехи = Стр.НаименованиеВехи;
				Запись.Статус = Стр.Статус;
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
		
		ПроектныеРасчеты.ПересчитатьПроект(ТекущийПроект);
		
		Сообщить("✓ Проект сохранен");
		ОбновитьКарточкуПроектаНаСервере();
	Исключение
		Сообщить("✗ Ошибка сохранения проекта: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// ==================== ОТЧЕТЫ ====================

&НаСервере
Процедура СформироватьСтатусныйОтчетПоПроектуНаСервере()
	// Реализация статусного отчета по проекту
	Сообщить("Статусный отчет по проекту сформирован");
КонецПроцедуры

&НаСервере
Процедура СформироватьСтатусныйОтчетПоЭтапуНаСервере()
	// Реализация статусного отчета по этапу
	Сообщить("Статусный отчет по этапу сформирован");
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетПоОтклонениямНаСервере()
	// Реализация отчета по отклонениям
	Сообщить("Отчет по отклонениям от плана сформирован");
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетПоРискамНаСервере()
	// Реализация отчета по рискам
	Сообщить("Отчет по рискам сформирован");
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетПоПросроченнымНаСервере()
	// Реализация отчета по просроченным задачам
	Сообщить("Отчет по просроченным задачам сформирован");
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетПоЗадачамНаСегодняНаСервере()
	// Реализация отчета по задачам на сегодня
	Сообщить("Отчет по задачам на сегодня сформирован");
КонецПроцедуры

// ==================== НАСТРОЙКИ ====================

&НаСервере
Процедура ОбновитьСписокСотрудниковНаСервере()
	СписокСотрудников.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудник.Ссылка КАК Ссылка,
		|	Сотрудник.ФамилияИмяОтчество КАК ФИО,
		|	Сотрудник.Должность КАК Должность,
		|	Сотрудник.ДатаПриёмаНаРаботу КАК ДатаПриема,
		|	Сотрудник.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудник
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник.ФамилияИмяОтчество";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокСотрудников.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьСотрудника(Команда)
	// Открыть форму создания сотрудника
	Параметры = Новый Структура("Режим", "Создание");
	ОткрытьФорму("Catalog.Сотрудники.Form.ФормаЭлемента", Параметры);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаУволитьСотрудника(Команда)
	// Открыть выбор сотрудника для увольнения
	Параметры = Новый Структура("Режим", "Выбор");
	ОткрытьФорму("Catalog.Сотрудники.Form.ФормаЭлемента", Параметры);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРедактироватьИмя(Команда)
	// Редактирование имени пользователя
	Сообщить("Редактирование имени пользователя");
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРедактироватьФото(Команда)
	// Редактирование фото пользователя
	Сообщить("Редактирование фото пользователя");
КонецПроцедуры

// ==================== ОБЩИЕ ПРОЦЕДУРЫ ====================

&НаКлиенте
Процедура КомандаСоздатьПроект(Команда)
	Параметры = Новый Структура("Режим", "Создание");
	ОткрытьФорму("Catalog.Проект.Form.ФормаЭлемента", Параметры);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокПроектов(Команда)
	ПереключитьСтраницу("ГруппаСписокПроектов");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименитьФильтрПроекты(Команда)
	ОбновитьСписокПроектовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФильтрПроекты(Команда)
	ФильтрНаименование = "";
	ФильтрПланДатаНачала = Неопределено;
	ФильтрПланДатаОкончания = Неопределено;
	ФильтрСтатус = "";
	ОбновитьСписокПроектовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименитьФильтрЗадачи(Команда)
	ОбновитьТаблицуЗадачНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФильтрЗадачи(Команда)
	ФильтрНаименование = "";
	ФильтрПланДатаНачала = Неопределено;
	ФильтрПланДатаОкончания = Неопределено;
	ФильтрСтатус = "";
	ОбновитьТаблицуЗадачНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименитьФильтрЭтапы(Команда)
	ОбновитьТаблицуЭтаповНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФильтрЭтапы(Команда)
	ФильтрНаименование = "";
	ФильтрПланДатаНачала = Неопределено;
	ФильтрПланДатаОкончания = Неопределено;
	ФильтрСтатус = "";
	ОбновитьТаблицуЭтаповНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименитьФильтрРиски(Команда)
	ОбновитьСписокРисковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФильтрРиски(Команда)
	ФильтрНаименование = "";
	ФильтрРеализован = "";
	ФильтрДатаРеализации = Неопределено;
	ОбновитьСписокРисковНаСервере();
КонецПроцедуры
